---
kind: other
id: Properties.T:Autodesk.Revit.DB.ExtensibleStorage.DataStorage
source: html/bb67db20-f6c2-ce18-5400-0970430b27ed.htm
---
# DataStorage Properties

The id of the assembly instance to which the element belongs.